Revit 2027 API
ParameterTypeId.MaterialAssetParamSource Property
 "Source"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialAssetParamSource { get; }
Public Shared ReadOnly Property MaterialAssetParamSource As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialAssetParamSource {
	ForgeTypeId^ get ();
}
static member MaterialAssetParamSource : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace